api/app/controllers/todos_controller.rb

    def create
        todo = user.todos.create(todo_params)
---
INSERT INTO "todos" ("title", "description", "status", "priority", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        todo = user.todos.find(params[:id]).update(todo_params)
---
UPDATE "todos" SET "title" = ?, "description" = ?, "status" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", ""], ["description", ""], ["status", nil], ["priority", nil], ["updated_at", "2023-03-27 03:55:40.562907"], ["id", 3]]

    def destroy
        user.todos.find(params[:id]).destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]