api/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "description" = ?, "status" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", ""], ["description", ""], ["status", nil], ["priority", nil], ["updated_at", "2023-03-27 03:55:40.562907"], ["id", 3]]
---
    def update
        todo = user.todos.find(params[:id]).update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 6]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]
---
    def destroy
        user.todos.find(params[:id]).destroy

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def index
        todos = user.todos.all